Public Attributes | List of all members
API_Get3DComponentType Struct Reference
User input management
Parameters of the get component type in 3D operation. More...
#include <APIdefs_Interface.h>
 Public Attributes
API_Guid  | guid
Guid of the pointed element, or APINULLGuid, if no element is pointed.
Int32  | dbElemIdx
Index of the pointed element.
Int32  | bodyIdx
Index of the pointed body in the pointed element.
ULong  | ipgon
Index of the pointed polygon in the pointed element.
API_Coord3D  | c3
Model coordinate of the point.
API_Coord3D  | normal
Normal vector of the pointed polygon.
Detailed Description
Parameters of the get component type in 3D operation.
Remarks
For the utilization of API_Get3DComponentType see the ACAPI_UserInput_GetPoint function.
Member Data Documentation
◆ bodyIdx
 API_Get3DComponentType::bodyIdx
Index of the pointed body in the pointed element.
◆ c3
 API_Get3DComponentType::c3
Model coordinate of the point.
◆ dbElemIdx
 API_Get3DComponentType::dbElemIdx
Index of the pointed element.
◆ guid
 API_Get3DComponentType::guid
Guid of the pointed element, or APINULLGuid, if no element is pointed.
◆ ipgon
 API_Get3DComponentType::ipgon
Index of the pointed polygon in the pointed element.
◆ normal
 API_Get3DComponentType::normal
Normal vector of the pointed polygon.